import ForegroundTemplate from '@components/layout/ForegroundTemplate';
import styled from 'styled-components';

const content = `제1장 총칙

제1조. 목적

- 이 약관은 뱅키즈(이하 “회사”라 합니다)가 제공하는 생활관리서비스, 제반서비스 등 서비스(이하 “서비스”라 합니다)의 이용과 관련하여 회사와 이용자와의 권리, 의무 및 책임사항 등을 규정함을 목적으로 합니다.

제2조. 용어 정의

- "회사"라 함은 생활관리 서비스 및 제반서비스를 제공하는 자를 말합니다.
- "이용자"라 함은 "회사"의 사이트에 접속하여 이 약관에 따라 "회사"가 제공하는 “서비스”를 이용하는 회원 및 비회원을 말합니다.
- "회원"이라 함은 "회사"와 이용계약을 체결하고 "이용자" 아이디(ID)를 부여받은 "이용자"로서 "회사"의 정보를 지속적으로 제공받으며 "회사"가 제공하는 서비스를 지속적으로 이용할 수 있는 자를 말합니다.
- "비회원"이라 함은 "회원"이 아니면서 "회사"가 제공하는 서비스를 이용하는 자를 말합니다.
- "서비스"라 함은 “회사”가 “이용자”들을 대상으로 제공하는 용돈 받기, 소비, 저축 등과 같은 금융 및 생활관리 서비스와 그 제반서비스를 스마트폰, 태블릿기기 등을 통해 제공하는 것을 의미합니다. 
- "아이디(ID)"라 함은 "회원"의 식별과 서비스이용을 위하여 "회원"이 정하고 "회사"가 승인하는 문자 또는 숫자의 조합을 말합니다.
- "비밀번호(PASSWORD)"라 함은 "회원"이 부여받은 "아이디"와 일치되는 "회원"임을 확인하고 비밀보호를 위해 "회원" 자신이 정한 문자 또는 숫자의 조합을 말합니다.

제3조. 신원정보 등의 제공

- "회사"는 이 약관의 내용, 상호, 대표자 성명, 영업소 소재지 주소(소비자의 불만을 처리할 수 있는 곳의 주소를 포함), 전화번호, 모사전송번호, 전자우편주소, 사업자등록번호, 통신판매업 신고번호 및 개인정보관리책임자 등을 앱 서비스 내 연결화면을 통하여 볼 수 있도록 할 수 있습니다.

제4조. 약관의 게시 

- "회사"는 이 약관을 "회원"이 서비스 화면을 통해 확인하거나 기타 방법으로 확인할 수 있도록 게시합니다.
- "회사"는 "이용자"가 "회사"와 이 약관의 내용에 관하여 질의 및 응답할 수 있도록 기술적 장치를 설치합니다.
- "회사"는 "이용자"가 약관에 정하여져 있는 내용 중 중요한 내용을 별도의 팝업화면이나 굵은 문자 등으로 표시하여 쉽게 이해할 수 있도록 합니다. 

제5조. 약관의 개정 

- "회사"는 관련법을 위배하지 않는 범위에서 이 약관을 개정할 수 있습니다.
- "회사"가 약관을 개정할 경우에는 적용일자 및 개정사유를 명시하여 현행약관과 함께 적용일자 7일 이전부터 서비스 내 확인할 수 있도록 공지하고, 기존회원에게는 팝업창, 유Ÿ무선 등의 방법으로 통지합니다. 
- "회사"가 약관을 개정한 후, "이용자"가 개정약관의 적용에 동의하지 않는 경우 회원가입을 탈퇴할 수 있습니다.

제6조. 약관의 해석

- 이 약관에서 정하지 아니한 사항과 이 약관의 해석에 관하여는 약관의 규제에 관한 법률, 기타 관계법령 또는 상관례에 따릅니다.

제7조. 약관의 효력 

- 본 약관은 이용자가 동의한 날로부터 회원자격을 유지하는 날까지 적용하는 것을 원칙으로 합니다. 단, 본 약관의 일부 조항의 경우에는 회원자격이 끝난 후에도 유효하게 적용될 수 있습니다. 
- 본 약관은 이용자가 약관에 동의하여 회원가입을 신청한 후부터 효력이 발생합니다. 
- 변경된 약관에 대해서 공지를 하고, 시행일 7일 후까지 거부의사를 표시하지 않은 경우 개정약관을 승인한 것으로 간주합니다. 


제2장 회원가입

제8조. 회원가입

- 회원가입은 "이용자"가 회사가 정한 가입양식에 따라 회원의 동의가 필요한 부분에 동의한 후, "회사"가 이러한 신청에 대하여 승낙함으로써 체결됩니다.
- 실명이나 실제 정보를 입력하지 않은 경우, 법적인 보호를 받을 수 없으며 서비스 사용에 제한을 받을 수 있습니다.
- "회사"는 다음 각 호에 해당하는 신청에 대하여는 승낙을 하지 않을 수 있습니다.
1) 가입신청자가 이 약관에 의하여 이전에 회원자격을 상실한 적이 있는 경우
2) 타인의 명의를 이용한 경우
3) 허위의 정보를 기재하거나, 회사가 제시하는 내용을 기재하지 않은 경우
4) 이용자의 귀책사유로 인하여 승인이 불가능하거나 기타 규정한 제반 사항을 위반하며 신청하는 경우
5) 부정한 목적으로 해당 서비스를 이용하고자 하는 경우 
- "회사"는 서비스 관련 설비의 여유가 없거나, 기술상 또는 업무상 문제가 있는 경우에는 승낙을 유보할 수 있습니다.
- 회원가입신청의 승낙을 하지 아니하거나 유보한 경우, "회사"는 이를 팝업창, 유Ÿ무선 등의 방법으로 신청자에게 알립니다. 단, "회사"의 귀책사유 없이 신청자에게 통지할 수 없는 경우에는 예외로 합니다.
- 부모는 회원가입을 해야만 개괄적인 자녀의 서비스 이용내역에 대해 확인할 수 있습니다. 
- 가족 연결이 되지 않은 경우여도, 이용자의 가입양식에 회사가 승낙한 후부터 회원자격을 얻을 수 있습니다.

제9조. 미성년자의 회원가입에 관한 특칙

- 만 14세 미만의 "이용자"는 개인정보의 수집 및 이용목적에 대하여 충분히 숙지하고, 부모 등 법정대리인의 동의를 얻은 후에 회원가입을 신청하는 등 본인의 개인정보를 신중하게 제공하여야 합니다.
- 회사는 만 14세 미만의 “이용자”와 보호자를 서비스 내에서 연결시키면서 보호자의 동의 여부를 확인합니다. 
- 회사는 보호자 동의에 대한 확인절차를 거치지 않은 만 14세 미만 이용자에 대해서는 회원가입을 불허 또는 취소할 수도 있습니다. 
- 만 14세 미만 "이용자"의 부모 등 법정대리인은 아동에 대한 개인정보의 열람, 정정, 갱신을 요청하거나 회원가입에 대한 동의를 철회할 수 있으며, 이러한 경우에 "회사"는 지체 없이 필요한 조치를 취해야 합니다.

제10조. 회원정보의 변경

-  "회원"은 서비스 내 “마이페이지”에서 언제든지 자신의 개인정보를 열람할 수 있으며, 프로필 수정을 통해 개인정보를 수정할 수 있습니다. 
- “회원”이 변경사항을 제공하지 않아 발생한 불이익에 대하여 "회사"는 책임지지 않습니다.

제11조. 회원의 아이디 및 비밀번호의 관리에 대한 의무

- "회원"의 "아이디"와 "비밀번호"에 관한 관리책임은 "회원"에게 있으며, 이를 제3자가 이용하도록 하여서는 안 됩니다.
- "회원"은 "아이디" 및 "비밀번호"가 도용되거나 제3자에 의해 사용되고 있음을 인지한 경우에는 이를 즉시 "회사"에 통지하고 "회사"의 안내에 따라야 합니다.
- 전항의 경우 "회원"이 "회사"에 그 사실을 통지하지 않거나, 통지한 경우에도 "회사"의 안내에 따르지 않아 발생한 불이익에 대하여 "회사"는 책임지지 않습니다.

제12조. 회원에 대한 통지 

- "회사"가 "회원"에 대한 통지를 하는 경우 "회원"이 제공한 연락처, 이메일, 로그인 시 팝업창 등 각종 통지수단을 통해 할 수 있습니다.  
- “회사”가 “회원”전체에 대한 통지 혹은 중대한 사항이 아닐 경우 “회사”가 제공하는 서비스 내에서 공지함으로써 전항의 통지를 대신할 수 있습니다. 

제13조. 회원탈퇴 및 자격 상실 

- "회원"은 "회사"에 언제든지 탈퇴를 요청할 수 있으며 "회사"는 즉시 회원탈퇴를 처리합니다.
- "회사"가 회원자격을 상실시키는 경우에는 회원등록을 말소합니다. 이 경우 "회원"에게 이를 통지하고, 회원등록 말소 전에 최소한 30일 이상의 기간을 정하여 소명할 기회를 부여합니다.
- 회사는 회원이 본 약관 또는 관계법령 등을 위반하는 경우, 회원자격을 상실시킬 수 있습니다. 

제3장 서비스 이용 

제14조. 서비스의 내용 

- “회사"는 이용자에게 아래와 같은 서비스를 제공합니다.
1) 이용자가 목표 기반으로 저축 계획을 세워, 다른 이용자에게 이를 제안하는 것
2) 다른 이용자가 이를 수락 및 거절하여, 이용자가 저축계획을 수행하는 것 
3) 저축 수행에 관하여 수행 데이터를 한 눈에 확인할 수 있는 것 
- 해당 사항외에도 회사는 다양한 기능을 제공합니다. 회원은 서비스를 이용하여 자신의 생활(주로 금융)에 대한 정보를 입력할 수 있으며 흩어져 있는 정보들을 한 눈에 확인할 수 있습니다. 또한, 미성년자의 경우 법정대리인에게 해당 내용들이 간략하게 공유될 수 있습니다. 회사는 해당 정보들을 조합하여 가공하고, 분석하여 새로운 정보들을 회원에게 제공할 수 있습니다. 
- 새로운 정보들을 통하여 회원에게 금융과 관련된 의사결정 및 금융생활 습관화를 도와주며, 이를 적극적으로 도와주기 위하여 앱푸시나 알림을 통하여 회원에게 제공할 수 있습니다. 이는 서비스 내에서 수신 동의를 변경할 수도 있습니다. 
- 회원은 기본적으로 서비스를 무료로 이용할 수 있습니다. 다만, 회사가 서비스 전부 또는 일부에 대해서 유료로 제공할 수 있습니다. 
- 유료 서비스를 제공할 경우에는, 해당 서비스의 이용 요금, 납부 방법, 대금 환불 등 절차에 관하여 “유료서비스이용방법”을 별도로 제정하여 회원에게 공지합니다. 
- 회사는 이러한 서비스의 내용을 화면 초기에 제공하면서, 이용방법을 알려줍니다. 
- 회사는 연중무휴, 1일 24시간 서비스를 제공함을 원칙으로 합니다.
- 회사는 운영상 또는 기술상 이유가 있는 경우 서비스를 변경하거나 제공을 일시적으로 중단할 수 있습니다. 
- 전항의 경우, 회사가 사유 및 내용을 본 약관에 명시된 방법으로 회원에게 통지합니다. 
- 회사는 회원이 보다 나은 서비스를 이용할 수 있도록 서비스 제공 방식 및 내용들을 지속적으로 개선하고, 새로운 기능들을 추가할 것입니다. 또한, 일정한 기능이 도움이 되지 않는다고 판단이 되면, 해당 기능 제공을 중단할 수도 있습니다. 이러한 변경 또는 중단에 대해서는 본 약관에 명시된 방법으로 회원에게 통지합니다. 
- 또한, 회사는 좋은 서비스를 위하여 제 3자가 제공하는 서비스를 포함할 수도 있습니다. 이러한 경우에는 제공자를 명시하거나, 통지를 통해 계약의 당사자가 회사가 아닌 제3자라는 것을 인지시키도록 합니다. 

제15조. 이용계약의 성립

- "이용자"는 "회사"가 제공하는 다음 또는 이와 유사한 절차에 의하여 이용신청을 합니다. "회사"는 계약 체결 전에 각 호의 사항에 관하여 "이용자"가 정확하게 이해하고 실수 또는 착오 없이 거래할 수 있도록 정보를 제공합니다.
1) "콘텐츠" 목록의 열람 및 선택
2) 성명, 주소, 전화번호(또는 이동전화번호), 전자우편주소 등의 입력
3) 다른 이용자와 함께 이용하기 위한 초대 
4) 서비스의 이용방법 또는 “회사”가 제공한 유의 내용에 대한 확인 
5) 전항을 확인하거나 거부하는 표시(예, 마우스 클릭)
5. "콘텐츠"의 이용신청에 관한 확인 또는 "회사"의 확인에 대한 동의
- "회사"는 "이용자"의 이용신청이 다음 각 호에 해당하는 경우에는 승낙하지 않거나 승낙을 유보할 수 있습니다.
1) 타인의 명의나 정보를 이용한 경우
2) 허위의 정보를 기재하거나, "회사"가 제시하는 내용을 기재하지 않은 경우
3) 미성년자가 청소년보호법에 의해서 이용이 금지되는 "콘텐츠"를 이용하고자 하는 경우
4) 서비스 관련 설비의 여유가 없거나, 기술상 또는 업무상 문제가 있는 경우
- "회사"는 이용자가 서비스 이용을 신청할 경우, 승낙으로 간주하여 이용자에게 통지하고, 승낙의 통지가 회원에게 도달한 시점에 계약이 성립한 것으로 봅니다.
- "회사"의 승낙의 의사표시에는 "이용자"의 이용신청에 대한 확인 및 서비스제공 가능여부, 이용신청의 정정·취소 등에 관한 정보 등을 포함합니다.
-  미성년이용자가 유료서비스를 이용하고자 하는 경우에 원칙적으로 보호자의 명의 또는 보호자의 동의하에 이루어져야 하고, 보호자는 본인 동의없이 체결된 미성년자의 계약을 취소할 수 있습니다.

제16조. 회사의 의무

- “회사"는 법령과 이 약관이 정하는 권리의 행사와 의무의 이행을 신의에 좇아 성실하게 하여야 합니다.
- "회사"는 "이용자"가 안전하게 서비스를 이용할 수 있도록 개인정보(신용정보 포함)보호를 위해 보안시스템을 갖추어야 하며 개인정보보호정책을 공시하고 준수합니다.
- "회사"가 유료서비스를 제공하는 경우 “회사”는 "이용자"가 유료서비스이용 및 그 대금내역을 수시로 확인할 수 있도록 조치합니다.
- "회사"는 서비스이용과 관련하여 "이용자"로부터 제기된 의견이나 불만이 정당하다고 인정할 경우에는 이를 지체없이 처리합니다. 이용자가 제기한 의견이나 불만사항에 대해서는 게시판을 활용하거나 온라인소통채널 등을 통하여 그 처리과정 및 결과를 전달합니다.
- "회사"는 이 약관에서 정한 회사의 의무 위반으로 인하여 회원이 입은 손해를 배상합니다.

제17조. 회원의 의무 

- 회원의 이용권한은 회원 개인에 한정되며, 타인에게 양도 및 증여 등을 제공할 수 없습니다.
- 회원은 관계법령, 이 약관의 규정, 이용안내 및 서비스와 관련하여 공지한 주의사항, "회사"가 통지하는 사항 등을 준수하여야 하며, 기타 "회사"의 업무에 방해되는 행위를 하여서는 안 됩니다
1) 회원이 신청 또는 변경할 때 허위내용을 기재하거나 타인의 정보를 도용한 경우 
2) 회사에서 제공한 정보나 서비스를 통하여 상행위를 하는 경우 
3) 제 3자의 저작권 등 지적재산권에 대한 침해, 제 3자의 명예를 손상시키는 등 제 3자의 이용에 있어서 방해하는 경우 
4) "회사"에 게시된 정보의 변경하거나 금지한 정보에 대해서 송신 또는 게시할 경우
5) 외설 또는 폭력적인 말이나 글, 화상, 음향, 기타 공서양속에 반하는 정보를 "회사"의 사이트에 공개 또는 게시하는 행위
6) 기타 불법적이거나 부당한 행위

제18조. 정보의 제공 및 광고의 게재

 - "회사"는 "이용자"가 서비스이용 중 필요하다고 인정되는 다양한 정보를 공지사항이나 전자우편 등의 방법으로 "회원"에게 제공할 수 있습니다. 다만, "회원"은 언제든지 전자우편 등을 통하여 수신 거절을 할 수 있습니다.
- "회사"는 서비스 제공과 관련하여 콘텐츠화면, 홈페이지, 전자우편 등에 광고를 게재할 수 있습니다. 광고가 게재된 전자우편 등을 수신한 "회원"은 수신거절을 "회사"에게 할 수 있습니다.
- “회사”는 회원에게 서비스 이용과 관련하여 전화번호로 공지 또는 광고를 진행할 수 있으며, 회원은 서비스 및 문의사항을 통하여 이를 거절할 수 있습니다. 

제19조. 게시물의 삭제

-	"회사"는 게시판에 정보통신망이용촉진 및 정보보호 등에 관한 법률을 위반한 청소년유해매체물이 게시되어 있는 경우에는 이를 지체 없이 삭제 합니다. 
-	"회사"가 운영하는 게시판 등에 게시된 정보로 인하여 법률상 이익이 침해된 자는 "회사"에게 당해 정보의 삭제 또는 반박내용의 게재를 요청할 수 있습니다. 이 경우 "회사"는 지체 없이 필요한 조치를 취하고 이를 즉시 신청인에게 통지합니다.
-	“회사”는 게시판에 작성한 회원의 게시물이나 글 등을 이용하여 마케팅 및 출판에 이용할 수 있으며, 해당 경우에는 회원에게 미리 공지하도록 합니다. 

제20조. 저작권 

- "회사"가 제공하는 모든 서비스와 작성한 저작물에 대한 저작권 기타 지식재산권 일체는 “회사”에 귀속합니다. 
- "회사"가 제공하는 서비스 중 제휴계약에 의해 제공되는 저작물에 대한 저작권 기타 지적재산권은 해당 제공업체에 귀속합니다.
- "이용자"는 "회사"가 제공하는 서비스를 이용함으로써 얻은 정보 중 "회사" 또는 제공업체에 지적재산권이 귀속된 정보를 "회사" 또는 제공업체의 사전승낙 없이 복제, 전송, 출판, 배포, 방송 기타 방법에 의하여 영리목적으로 이용하거나 제3자에게 이용하게 하여서는 안 됩니다.
- "이용자”가 “회사”의 서비스를 통해 게시물을 제작할 경우, 해당 게시물의 저작권은 이를 게시한 이용자에게 귀속됩니다. 단, 이용자가 공유를 목적으로 배포한 게시물 또는 동의를 얻은 게시물에 한해서는 이용자의 게시물을 이용, 전시, 배포 및 수정하는 것에 동의한 것으로 간주합니다. 
- “회사”는 “이용자”의 게시물에 대하여 노출할 필요가 있을 경우, 필요한 최소한의 범위에서만 이용할 수 있으며, 해당 범위를 넘어 이용하고자 하는 경우 사전에 미리 설명을 드린 후 동의를 얻어 사용할 수 있습니다. 

제21조. 개인정보보호

- "회사"는 "이용자"의 서비스 이용에 필요한 최소한의 정보를 수집할 수 있습니다. 이를 위해 "회사"가 문의한 사항에 관해 "이용자"는 진실한 내용을 성실하게 고지하여야 합니다.
- "회사"가 "이용자"의 개인 식별이 가능한 "개인정보"를 수집하는 때에는 당해 "이용자"의 동의를 받습니다.
- "회사"는 "이용자"가 이용신청 등에서 제공한 정보와 수집한 정보를 당해 "이용자"의 동의 없이 목적 외로 이용하거나 제3자에게 제공할 수 없습니다. 다만, 다음과 같은 경우는 예외로 둡니다. 
1) 통계작성, 학술연구 또는 시장조사를 위하여 필요한 경우로서 특정 개인을 식별할 수 없는 형태로 제공하는 경우
2) 도용방지를 위하여 본인확인에 필요한 경우
3) 약관의 규정 또는 법령에 의하여 필요한 불가피한 사유가 있는 경우
- 개인정보보호와 관련된 자세한 사항은 회사 웹사이트에서 제공되는 개인정보처리방침에서 확인할 수 있습니다. 


제4장 이용계약의 해지 

제22조. 이용계약 해지 

-	이용자가 서비스의 이용을 원하지 않을 경우, 언제든지 서비스 탈퇴를 통해 이용계약을 해지할 수 있습니다. 단, 관련 법령을 위배하거나 분쟁이 있는 경우에는 해지가 제한될 수 있습니다. 
-	이용자는 회사의 해지 및 이용제한에 대하여 부당하다고 생각할 경우, 회사의 웹사이트 및 문의채널 등을 통해 이의신청을 할 수 있습니다. 이 때 이의가 정당하다고 “회사”가 인정하는 경우, “회사”는 즉시 서비스 이용을 재개합니다. 
-	이용자가 이용계약을 해지하는 순간 제공한 개인정보 및 데이터들은 삭제됩니다. 다만, 서비스 운영에 있어 필요한 범위 내의 데이터의 경우에는 삭제되지 않습니다.  

제5장 기타

제23조. 이용자 피해보상

-	“회사”는 서비스 중지 또는 장애가 발생할 경우, 24시간 이내에 회원에게 고지합니다. 

제24조. 면책조항 

-	“회사”는 천재지변 또는 이에 준하는 불가항력으로 인하여 서비스를 제공할 수 없는 경우에는 서비스 제공에 대한 책임이 면제됩니다. 
-	“회사”는 “이용자”의 귀책사유로 인한 장애에 대하여는 책임을 지지 않습니다. 
-	“회사”는 “이용자” 상호간 서비스를 매개로 하여 발생한 분쟁 등에 대하여는 개입을 하지않으며, 책임도 지지 않습니다. 
-	“회사”는 “이용자”가 서비스와 관련하여 게재한 정보, 자료, 사실의 신뢰도, 정확성 등의 내용에 관하여는 책임을 지지 않습니다.
-	“회사”는 “이용자”가 서비스와 관련하여 게재한 정보, 자료, 사실의 신뢰도, 정확성 등의 내용에 관하여는 책임을 지지 않습니다.

제25조. 분쟁의 해결

- "회사"는 분쟁이 발생하였을 경우에 "이용자"가 제기하는 정당한 의견이나 불만을 반영하여 적절하고 신속한 조치를 취합니다. 다만, 신속한 처리가 곤란한 경우에 "회사"는 "이용자"에게 그 사유와 처리일정을 통보합니다.

본 약관은 2022.9.6부터 적용됩니다. 

`;

function Terms() {
  return (
    <ForegroundTemplate label="서비스 약관" to="/mypage/manage">
      <Content>{content}</Content>
    </ForegroundTemplate>
  );
}

export default Terms;

const Content = styled.div`
  padding: 26px;
  padding-top: 40px;
  ${({ theme }) => theme.typo.text.S_14_M}
  color: ${({ theme }) => theme.palette.greyScale.black};
  white-space: pre-wrap;
`;
