import styled from 'styled-components';
import ForegroundTemplate from '@components/atoms/layout/ForegroundTemplate';

const content = `
<  뱅키즈  >('bankidz.com   '이하  '회사’라 한다)는 「개인정보 보호법」 제30 조에 따라 정보주체의
개인정보를 보호하고 이와 관련한 고충을 신속하고 원활하게 처리할 수 있도록 하기 위하여 다음과 같이
개인정보 처리방침을 수립·공개합니다.

○ 이 개인정보처리방침은 2022 년 9 월 7 부터 적용됩니다.

뱅키즈의 개인정보처리방침의 구성 내용은 다음과 같습니다. 

1. 개인정보의 처리 목적 
2. 개인정보의 처리 및 보유 기간
3. 처리 항목 
4. 만 14 세 미만 아동의 개인정보 처리에 관한 사항
5. 개인정보의 제3 자 제공
6. 개인정보처리의 위탁 
7. 개인정보의 파기절차 및 파기방법
8. 정보주체와 법정대리인의 권리·의무 및 그 행사방법
9. 개인정보의 안전성 확보조치
10. 개인정보 자동 수집 장치의 설치·운영 및 거부에 관한 사항
11. 행태정보의 수집·이용·제공 및 거부 등에 관한 사항
12. 개인정보 보호책임자
13. 정보주체의 권익침해에 대한 구제방법
14. 개인정보 처리방침 변경

제1조. 개인정보의 처리 목적

-  회사는 다음의 목적을 위하여 개인정보를 처리합니다.  처리하고 있는 개인정보는 다음의 목적 이외의
용도로는 이용되지 않으며 이용 목적이 변경되는 경우에는 개인정보 보호법 제18 조에 따라 별도의 동의를
받는 등 필요한 조치를 이행할 예정입니다.
1) 홈페이지 회원가입 및 관리
회원 가입의사 확인, 회원제 서비스 제공에 따른 본인 식별·인증, 회원자격 유지·관리 목적으로 개인정보를
처리합니다.
2) 민원사무 처리
민원인의 신원 확인, 민원사항 확인 목적으로 개인정보를 처리합니다.
3) 재화 또는 서비스 제공
물품배송, 서비스 제공, 콘텐츠 제공, 본인인증을 목적으로 개인정보를 처리합니다.
4) 마케팅 및 광고에의 활용
신규 서비스(제품) 개발 및 맞춤 서비스 제공, 이벤트 및 광고성 정보 제공 및 참여기회 제공 , 인구통계학적
특성에 따른 서비스 제공 및 광고 게재 , 서비스의 유효성 확인 등을 목적으로 개인정보를 처리합니다.
5) 기타
분쟁조정을 위한 자료 및 기타 통계자료 산출 등을 목적으로 개인정보를 처리합니다.
- 회사는 수집한 개인정보들을 알아볼 수 없도록 가명처리하여 통계작성, 기록보존 등을 위하여 처리할 수
있습니다. 

제2조. 개인정보의 처리 및 보유 기간 

- 회사의 각각의 개인정보 처리 및 보유 기간은 다음과 같습니다.
1) 보유항목: 제 3 조에 나와있는 처리항목과 동일
2) 보유기간: 회원자격이 유지되는 기간동안 (회원 탈퇴 전까지)
3) 보유근거: 이용약관 및 개인정보처리방침
-  회원탈퇴 이후에도 관련법령에 따라 보존할 필요가 있는 경우 회사는 아래와 같이 일정
기간동안회원정보를 보관합니다. 
1) 신용정보의 수집/처리 및 이용 등에 관한 기록 : 3 년
2) 소비자의 불만 또는 분쟁처리에 관한 기록 : 3 년
3) 계약 또는 청약철회 등에 관한 기록 : 5 년
4) 표시/광고에 관한 기록 : 6 개월
5) 통신사실확인자료: 3 개월
-  가명처리가 된 정보들은 회원탈퇴 이후에도 보관되어 있으며, 가명정보는 재식별되지 않도록 분리하여
별도 저장 및 관리하고, 기술적 및 관리적 보호조치를 취합니다.
- 또한, 아래와 같은 예외사유가 생길 경우 회원정보를 보관합니다.
1) 관계 법령 위반에 따른 수사.조사 등이 진행중인 경우에는 해당 수사.조사 종료시까지 
2) 홈페이지 이용에 따른 채권.채무관계 잔존시에는 해당 채권.채무관계 정산시까지

제3조. 처리 항목 

- 회사는 다음의 개인정보 항목을 처리하고 있습니다.
1) 필수항목 : 이름, 생년월일, 성별, 로그인ID, 비밀번호
2) 선택항목 : 이메일, 휴대전화번호
- 인터넷 서비스 이용과정에서 아래 개인정보 항목이 자동으로 생성되어 수집될 수 있습니다. 
: IP 주소, 쿠키, MAC 주소, 서비스 이용기록, 방문기록, 불량 이용기록 등
- 외부 플랫폼을 통한 서비스 이용 시 아래와 같은 정보를 제공받습니다. 
1) 카카오 계정: (필수) 닉네임
2) 애플 계정: (필수) 닉네임

제4조. 만 14세 미만 아동의 개인정보 처리에 관한 사항

- 회사는 만 14 세 미만 아동에 대해 개인정보를 수집할 때 법정대리인의 동의를 얻어 해당 서비스 수행에
필요한 최소한의 개인정보를 수집합니다.
1) 필수항목 : 법정 대리인의 성명, 관계
2) 선택항목: 연락처
-  또한, 회사의 홍보를 위해 아동의 개인정보를 수집할 경우에는 법정대리인으로부터 별도의 동의를
얻습니다.
-  회사는 만 14 세 미만 아동의 개인정보를 수집할 때에는 아동에게 법정대리인의 성명과 같이 최소한의
정보를 요구할 수 있으며, 다음 중 하나의 방법으로 적법한 법정대리인이 동의하였는지를 확인합니다.
1) 동의 내용을 게재한 인터넷 사이트에 법정대리인이 동의 여부를 표시하도록 하고 개인정보처리자가 그
동의 표시를 확인했음을 법정대리인의 휴대전화 문자 메시지로 알리는 방법
2) 동의 내용을 게재한 인터넷 사이트에 법정대리인이 동의 여부를 표시하도록 하고 법정대리인의 신용카드
·직불카드 등의 카드정보를 제공받는 방법
3) 동의 내용을 게재한 인터넷 사이트에 법정대리인이 동의 여부를 표시하도록 하고 법정대리인의 휴대전화
본인인증 등을 통해 본인 여부를 확인하는 방법
4) 동의 내용이 적힌 서면을 법정대리인에게 직접 발급하거나,  우편 또는 팩스를 통하여 전달하고
법정대리인이 동의 내용에 대하여 서명날인 후 제출하도록 하는 방법
5) 동의 내용이 적힌 전자우편을 발송하여 법정대리인으로부터 동의의 의사표시가 적힌 전자우편을
전송받는 방법
6) 전화를 통하여 동의 내용을 법정대리인에게 알리고 동의를 얻거나 인터넷주소 등 동의 내용을 확인할 수
있는 방법을 안내하고 재차 전화 통화를 통하여 동의를 얻는 방법
7) 앱 내에서 자체적으로 아동과의 가족 연결에 대하여 수락하는 방법 
8) 그 밖에 위와 준하는 방법으로 법정대리인에게 동의 내용을 알리고 동의의 의사표시를 확인하는 방법

제5조. 개인정보의 제3자 제공

- 회사는 개인정보를 원칙 내에서만 처리하지만, 다음과 같은 경우에는 예외로 작용합니다. 
1) 이용자들이 동의한 경우 (개인정보 제공업체, 이용 목적, 보유 및 이용기간은 별도로 공지)
2) 법령의 규정에 의거하거나, 수사 목적으로 적법한 절차에 따라 수사기관의 요구가 있는 경우

제6조. 개인정보처리의 위탁 

- 회사는 원활한 개인정보 업무처리를 위하여 다음과 같이 개인정보 처리업무를 위탁하고 있습니다. 
각 위탁받는 자, 위탁업무의 내용, 위탁기간은 다음과 같습니다.
1) 구글 애널리틱스 (Google Analytics)
위탁업무의 내용: 사용자 데이터 분석
위탁기간: 위탁관계가 끝나거나 회원자격이 유지되는 기간동안
2) AWS (Amazon Web Services)
위탁업무의 내용: 개인정보 DB 저장 및 관리 
위탁기간: 위탁관계가 끝나거나 회원자격이 유지되는 기간동안
- 회사는 위탁계약 체결시 「개인정보 보호법」 제26 조에 따라 위탁업무 수행목적 외 개인정보 처리금지, 기술적.
관리적 보호조치, 재위탁 제한, 수탁자에 대한 관리.감독, 손해배상 등 책임에 관한 사항을 계약서 등 문서에 
명시하고, 수탁자가 개인정보를 안전하게 처리하는지를 감독하고 있습니다.
- 위탁업무의 내용이나 수탁자가 변경될 경우에는 지체없이 본 개인정보 처리방침을 통하여 공개하도록 
하겠습니다

제7조. 개인정보의 파기절차 및 파기방법

- 회사는 개인정보 보유기간의 경과, 처리목적 달성 등 개인정보가 불필요하게 되었을 때에는 지체없이 해당
개인정보를 파기합니다.
단,  다른 법령에 따라 개인정보를 계속 보존하여야 하는 경우에는, 해당 개인정보를 별도의 데이터베이스
(DB)로 옮기거나 보관장소를 달리하여 보존합니다.
- 개인정보 파기의 절차 및 방법은 다음과 같습니다.
1) 파기절차
회사는 파기 사유가 발생한 개인정보를 선정하고, 회사의 개인정보 보호책임자의 승인을 받아 개인정보를
파기합니다.
2) 파기방법
전자적 파일 형태의 정보는 기록을 재생할 수 없는 기술적 방법을 사용합니다.
종이에 출력된 개인정보는 분쇄기로 분쇄하거나 소각을 통하여 파기합니다

제8조. 정보주체와 법정대리인의 권리·의무 및 그 행사방법

-정보주체는 회사에 대해 언제든지 다음 각 호의 개인정보 보호 관련 권리를 행사할 수 있습니다. 단, 만 14
세 미만 아동에 관한 개인정보 열람 등 요구는 법정대리인이 직접 해야 하며,  만 14 세 이상의 미성년자인
경우에는 미성년자 본인이 권리를 행사할 수 있습니다. 
1) 개인정보의 정정 및 삭제 등은 서면, 전화, 전자우편, 모사전송(FAX) 등을 통하여 하실 수 있으며 회사는
이에 대해 지체없이 조치하겠습니다. 
2) 정보주체가 개인정보의 오류 등에 대한 정정 또는 삭제를 요구한 경우에는 회사는 정정 또는 삭제를
완료할 때까지 당해 개인정보를 이용하거나 제공하지 않습니다. 
3) 제1 항에 따른 권리 행사는 정보주체의 법정대리인이나 위임을 받은 자 등 대리인을 통하여 하실 수
있습니다. 이 경우 개인정보 보호법 시행규칙 별지 제11 호 서식에 따른 위임장을 제출하셔야 합니다. 
4) 정보주체는 개인정보 보호법 등 관계법령을 위반하여 회사가 처리하고 있는 정보주체 본인이나 타인의
개인정보 및 사생활을 침해하여서는 아니됩니다.
5) 회사는 정보주체 권리에 따른 열람의 요구, 정정·삭제의 요구, 처리정지의 요구 시 열람 등 요구를 한 자가
본인이거나 정당한 대리인인지를 확인합니다.

제9조. 개인정보의 안전성 확보조치

회사는 개인정보의 안전성 확보를 위해 다음과 같은 조치를 취하고 있습니다.
1) 정기적인 자체 감사 실시
개인정보 취급 관련 안정성 확보를 위해 정기적(분기 1 회)으로 자체 감사를 실시하고 있습니다.
2) 개인정보 취급 직원의 최소화 및 교육
개인정보를 취급하는 직원을 지정하고 담당자에 한정시켜 최소화 하여 개인정보를 관리하는 대책을
시행하고 있습니다.
3) 내부관리계획의 수립 및 시행
개인정보의 안전한 처리를 위하여 내부관리계획을 수립하고 시행하고 있습니다.
4) 접속기록의 보관 및 위변조 방지
개인정보처리시스템에 접속한 기록을 최소 1 년 이상 보관, 관리하고 있으며,다만, 5 만명 이상의
정보주체에 관하여 개인정보를 추가하거나, 고유식별정보 또는 민감정보를 처리하는 경우에는 2 년이상
보관, 관리하고 있습니다. 또한, 접속기록이 위변조 및 도난, 분실되지 않도록 보안기능을 사용하고
있습니다.
5) 개인정보에 대한 접근 제한
개인정보를 처리하는 데이터베이스시스템에 대한 접근권한의 부여,변경,말소를 통하여 개인정보에 대한
접근통제를 위하여 필요한 조치를 하고 있으며 침입차단시스템을 이용하여 외부로부터의 무단 접근을
통제하고 있습니다.

제10조. 개인정보 자동 수집 장치의 설치·운영 및 거부에 관한 사항

-  회사는 이용자에게 개별적인 맞춤서비스를 제공하기 위해 이용정보를 저장하고 수시로 불러오는 ‘쿠키
(cookie)’를 사용합니다.
-  쿠키는 웹사이트를 운영하는데 이용되는 서버(http)가 이용자의 컴퓨터 브라우저에게 보내는 소량의
정보이며 이용자들의 PC 컴퓨터내의 하드디스크에 저장되기도 합니다.
1) 쿠키의 사용 목적 : 이용자가 방문한 각 서비스와 웹 사이트들에 대한 방문 및 이용형태,  인기 검색어,
보안접속 여부, 등을 파악하여 이용자에게 최적화된 정보 제공을 위해 사용됩니다.
2) 쿠키의 설치•운영 및 거부 : 웹브라우저 상단의 도구>인터넷 옵션>개인정보 메뉴의 옵션 설정을 통해
쿠키 저장을 거부 할 수 있습니다.
3) 쿠키 저장을 거부할 경우 맞춤형 서비스 이용에 어려움이 발생할 수 있습니다.

제11조. 개인정보 보호책임자

- 회사는 개인정보 처리에 관한 업무를 총괄해서 책임지고, 개인정보 처리와 관련한 정보주체의 불만처리 및
피해구제 등을 위하여 아래와 같이 개인정보 보호책임자를 지정하고 있습니다.
1) 개인정보 보호책임자
성명 :안도영
직책 :대표
직급 :대표
연락처 :010-8479-9579, ppocketdon@gmail.com
이용자는 회사의 서비스를 이용하며 발생한 모든 개인정보 보호 관련 문의,  불만처리,  피해구제 등에 관한
사항을 개인정보 보호책임자 및 담당부서로 문의하실 수 있습니다.  회사는 정보주체의 문의에 대해 지체
없이 답변 및 처리해드릴 것입니다.

제12조. 권익침해에 대한 구제방법

-  정보주체는 개인정보침해로 인한 구제를 받기 위하여 개인정보분쟁조정위원회, 한국인터넷진흥원
개인정보침해신고센터 등에 분쟁해결이나 상담 등을 신청할 수 있습니다. 이 밖에 기타 개인정보침해의
신고, 상담에 대하여는 아래의 기관에 문의하시기 바랍니다.
1) 개인정보분쟁조정위원회 : (국번없이) 1833-6972 (www.kopico.go.kr)
2) 개인정보침해신고센터 : (국번없이) 118 (privacy.kisa.or.kr)
3) 대검찰청 : (국번없이) 1301 (www.spo.go.kr)
4) 경찰청 : (국번없이) 182 (ecrm.cyber.go.kr)

제13조. 개인정보 처리방침 변경

- 개인정보 처리방침은 2022.9.7 부터 적용됩니다.
- 회사는 개인정보 처리방침을 개정하는 경우 홈페이지의 공지사항을 통하여 고지할 것입니다. `;

function Privacy() {
  return (
    <ForegroundTemplate label="개인정보 처리방침" to="/mypage/manage">
      <Content>{content}</Content>
    </ForegroundTemplate>
  );
}

export default Privacy;

const Content = styled.div`
  padding: 26px;
  padding-top: 40px;
  ${({ theme }) => theme.typo.text.S_14_M}
  color: ${({ theme }) => theme.palette.greyScale.black};
  white-space: pre-wrap;
`;
